namespace Common.Models.Responses
{
    /// <summary>
    /// 通用返回类
    /// </summary>
    public class Res
    {
        /*
        /// <summary>
        /// 结果
        /// 200：成功
        /// 70001：该登录名未注册
        /// 90000：用户名或密码为空
        /// 90001：用户名已存在
        /// 90004：原登录密码错误
        /// 90005：token验证不通过
        /// 92000：密码强度弱，请使用10位以上大小写字母加数字组合
        /// 92001：密码强度强
        /// 99999：参数校验失败
        /// <summary>
        /// 结果
        /// 200：成功
        /// 80000：未知错误
        /// 80001：用户名或密码不对
        /// 80002：用户不存在
        /// 80003：未知用户类型
        /// 80004：此用户不存在
        /// 80005：未绑定第三方身份
        /// 80006：您的账号暂无法使用，请联系百运客服处理。
        /// 80007：验证码填写不正确
        /// 80008：此用户为英文网用户
        /// 80009：微信验证失败
        /// 90000：用户名或密码为空
        /// 90005：token验证不通过
        /// 90006：暂不支持子账号登录
        /// 
        /// </summary>
         */
        public string code { get; set; }

        /// <summary>
        /// 返回信息
        /// </summary>
        public string message { get; set; }
    }
}
